Infineon/mtb-example-psoc6-radar-presence/source/main.c
/* ***************************************************************************
** File name: main.c
**
** Description: This is the main file for PSOC6 Radar Presence Code Example.
**
*******************************************************************************
* Copyright 2024, Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
*
* This software, including source code, documentation and related
* materials ("Software") is owned by Cypress Semiconductor Corporation
* or one of its affiliates ("Cypress") and is protected by and subject to
* worldwide patent protection (United States and foreign),
* United States copyright laws and international treaty provisions.
* Therefore, you may use this Software only as provided in the license
* agreement accompanying the software package from which you
* obtained this Software ("EULA").
* If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
* non-transferable license to copy, modify, and compile the Software
* source code solely for use in connection with Cypress's
* integrated circuit products.  Any reproduction, modification, translation,
* compilation, or representation of this Software except as specified
* above is prohibited without the express written permission of Cypress.
*
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
* EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
* reserves the right to make changes to the Software without notice. Cypress
* does not assume any liability arising out of the application or use of the
* Software or any product or circuit described in the Software. Cypress does
* not authorize its products for use in any products where a malfunction or
* failure of the Cypress product may reasonably be expected to result in
* significant property damage, injury or death ("High Risk Product"). By
* including Cypress's product in a High Risk Product, the manufacturer
* of such system or application assumes all risk of such use and in doing
* so agrees to indemnify Cypress against all liability.
*******************************************************************************/

#include <inttypes.h>
#include <stdio.h>

#include "cy_pdl.h"
#include "cyhal.h"
#include "cybsp.h"
#include "cy_retarget_io.h"

#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "timers.h"

#include "cli_task.h"
#include "resource_map.h"
#include "xensiv_bgt60trxx_mtb.h"
#include "xensiv_radar_presence.h"
#include "radar_config_optimizer.h"

#include "radar_low_framerate_config.h"

#include "radar_high_framerate_config.h"

#define XENSIV_RADAR_PRESENCE_SETTINGS_H_IMPL
#include "presence_settings.h"

#include "xensiv_radar_data_management.h"
#include "optimization_list.h"

/*******************************************************************************
* Macros
********************************************************************************/

#define XENSIV_BGT60TRXX_SPI_FREQUENCY      (25000000UL)

/* RTOS tasks */
#define MAIN_TASK_NAME                      "main_task"
#define MAIN_TASK_STACK_SIZE                (configMINIMAL_STACK_SIZE * 4)
#define MAIN_TASK_PRIORITY                  (configMAX_PRIORITIES - 2)
#define PROCESSING_TASK_NAME                "processing_task"
#define PROCESSING_TASK_STACK_SIZE          (configMINIMAL_STACK_SIZE * 4)
#define PROCESSING_TASK_PRIORITY            (configMAX_PRIORITIES - 3)
#define CLI_TASK_NAME                       "cli_task"
#define CLI_TASK_STACK_SIZE                 (configMINIMAL_STACK_SIZE * 20)
#define CLI_TASK_PRIORITY                   (tskIDLE_PRIORITY)

/* Interrupt priorities */
#define GPIO_INTERRUPT_PRIORITY             (7)


/*******************************************************************************
* Function Prototypes
********************************************************************************/
static void main_task(void *pvParameters);
static void processing_task(void *pvParameters);
static void timer_callbak(TimerHandle_t xTimer);

static int32_t init_leds(void);
static int32_t init_sensor(void);
static void process_verbose_cmd(xensiv_radar_presence_handle_t handle, XENSIV_RADAR_PRESENCE_TIMESTAMP time_ms);
static void xensiv_bgt60trxx_interrupt_handler(void* args, cyhal_gpio_event_t event);
void presence_detection_cb(xensiv_radar_presence_handle_t handle,
                           const xensiv_radar_presence_event_t* event,
                           void *data);

/*******************************************************************************
 * Local Declarations
 ********************************************************************************/

typedef struct {
    xensiv_radar_presence_event_t last_reported_event;
    bool verbose;
    XENSIV_RADAR_PRESENCE_TIMESTAMP bookmark_timestamp;
}ce_state_s;


/*******************************************************************************
* Global Variables
********************************************************************************/
static cyhal_spi_t spi_obj;
static xensiv_bgt60trxx_mtb_t bgt60_obj;
static float32_t frame[NUM_SAMPLES_PER_FRAME * 2];
static float32_t avg_chirp[NUM_SAMPLES_PER_CHIRP];

static TaskHandle_t main_task_handler;
static TaskHandle_t processing_task_handler;
static TimerHandle_t timer_handler;
radar_data_manager_s mgr;

ce_state_s ce_app_state;

volatile bool print_job_locked;

/*******************************************************************************
* Function Name: read_radar_data
********************************************************************************
* Summary:
* This is the function for reading radar data using buffering
*
* Parameters:
*  * data: pointer to radar data
*  *num_samples: pointer to number of samples per frame
*  samples_ub: maximum number of samples to be copied at a time from owner task/caller
*
* Return:
*  int32_t: 0 if success
*
*******************************************************************************/
int32_t read_radar_data(uint16_t* data, uint32_t *num_samples, uint32_t samples_ub)
{
    if (xensiv_bgt60trxx_get_fifo_data(&bgt60_obj.dev,
            data,
            NUM_SAMPLES_PER_FRAME) == XENSIV_BGT60TRXX_STATUS_OK)
    {
        *num_samples = NUM_SAMPLES_PER_FRAME *2; // in bytes

        if (samples_ub < NUM_SAMPLES_PER_FRAME *2)
        {
            xensiv_bgt60trxx_soft_reset(&bgt60_obj.dev,XENSIV_BGT60TRXX_RESET_FIFO );
        }
    }

