Infineon/mtb-example-psoc6-radar-presence/source/main.c
    return 0;
}


/*******************************************************************************
* Function Name: xensiv_bgt60trxx_interrupt_handler
********************************************************************************
* Summary:
* This is the interrupt handler to react on sensor indicating the availability 
* of new data
*    1. Notifies main task on interrupt from sensor
*
* Parameters:
*  void
*
* Return:
*  none
*
*******************************************************************************/
#if defined(CYHAL_API_VERSION) && (CYHAL_API_VERSION >= 2)
static void xensiv_bgt60trxx_interrupt_handler(void *args, cyhal_gpio_event_t event)
#else
static void xensiv_bgt60trxx_interrupt_handler(void *args, cyhal_gpio_irq_event_t event)
#endif
{
    CY_UNUSED_PARAMETER(args);
    CY_UNUSED_PARAMETER(event);

    mgr.run(true);
}


/*******************************************************************************
* Function Name: init_leds
********************************************************************************
* Summary:
* This function initializes the GPIOs for LEDs and set them to off state.
* Parameters:
*  void
*
* Return:
*  Success or error
*
*******************************************************************************/
static int32_t init_leds(void)
{
    if(cyhal_gpio_init(USER_LED1, CYHAL_GPIO_DIR_OUTPUT, CYHAL_GPIO_DRIVE_STRONG, false)!= CY_RSLT_SUCCESS)
    {
        printf("[MSG] ERROR: GPIO initialization for USER_LED1 failed\n");
        return -1;
    }
    if( cyhal_gpio_init(USER_LED2, CYHAL_GPIO_DIR_OUTPUT, CYHAL_GPIO_DRIVE_STRONG, false)!= CY_RSLT_SUCCESS)
    {
        printf("[MSG] ERROR: GPIO initialization for USER_LED2 failed\n");
        return -1;
    }
    return 0;
}


/*******************************************************************************
 * Function Name: process_verbose_cmd
 ********************************************************************************
 * Summary:
 * This function processes the prints the desired output on CLI provided
 * user has set the "verbose enabled" through Cli task.
 *
 * Parameters:
 *  void
 *
 * Return:
 *  none
 *
 *******************************************************************************/
void process_verbose_cmd(xensiv_radar_presence_handle_t handle,
        XENSIV_RADAR_PRESENCE_TIMESTAMP time_ms)
{
    float32_t energy = 0;
    int range_bin = 0;

    if (ce_app_state.verbose == false)
    {
        return;
    }

    if (ce_app_state.bookmark_timestamp + 1000 <= time_ms)
    {
        print_job_locked = true;

        switch (ce_app_state.last_reported_event.state)
        {
            case XENSIV_RADAR_PRESENCE_STATE_MACRO_PRESENCE:
                cyhal_gpio_write(USER_LED1, true);
                cyhal_gpio_write(USER_LED2, false);
                printf("[INFO] macro presence %" PRIi32 " %" PRIi32 "\n",
                        ce_app_state.last_reported_event.range_bin,
                        time_ms);
                break;

            case XENSIV_RADAR_PRESENCE_STATE_MICRO_PRESENCE:
                cyhal_gpio_write(USER_LED1, true);
                cyhal_gpio_write(USER_LED2, false);
                printf("[INFO] micro presence %" PRIi32 " %" PRIi32 "\n",
                        ce_app_state.last_reported_event.range_bin,
                        time_ms);
                break;

            case XENSIV_RADAR_PRESENCE_STATE_ABSENCE:
                cyhal_gpio_write(USER_LED1, false);
                cyhal_gpio_write(USER_LED2, true);
                printf("[INFO] absence %" PRIu32 "\n", time_ms);
                break;
            default:
                printf("[MSG] ERROR: Unknown reported state in event handling\n");
                break;
        }

        const cfloat32_t *macro_fft_buff = xensiv_radar_presence_get_macro_fft_buffer(handle);

        printf("[MACRO_FFT] %lu",(unsigned long)time_ms);

        for(int i = 0; i< MACRO_FFT_BUFF_SIZE; i++)
        {
            float zero[2] = { 0.f, 0.f};

            printf("%lf ", arm_euclidean_distance_f32((float*)&macro_fft_buff[i], zero, 2));
        }

        printf("\n");

        xensiv_radar_presence_get_max_macro(handle, &energy, &range_bin);
        printf("[MACRO] %d %lf %lu\n", range_bin, energy, (unsigned long)time_ms);

        xensiv_radar_presence_get_max_micro(handle, &energy, &range_bin);
        printf("[MICRO] %d %lf %lu\n", range_bin, energy, (unsigned long) time_ms);

        ce_app_state.bookmark_timestamp = time_ms;

        print_job_locked = false;
    }
}


/*******************************************************************************
* Function Name: timer_callbak
********************************************************************************
* Summary:
* This is the timer_callback which toggles the LED
*
* Parameters:
*  void
*
* Return:
*  none
*
*******************************************************************************/
static void timer_callbak(TimerHandle_t xTimer)
{
    (void)xTimer;

#ifdef TARGET_APP_CYSBSYSKIT_DEV_01
    cyhal_gpio_toggle(CYBSP_USER_LED);
#endif
}

/* [] END OF FILE */
